tests/UKHO.ERPFacade.API.FunctionalTests/ERPFacadeExpectedXmlFiles/UpdateCell.xml

<?xml version="1.0" encoding="utf-16"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <IM_MATINFO xmlns="">
        <CORRID>b28a8274-444a-4d5a-9d10-08dcc128489e</CORRID>
        <NOOFACTIONS>3</NOOFACTIONS>
        <RECDATE>20240920</RECDATE>
        <RECTIME>020716</RECTIME>
        <ORG>UKHO</ORG>
        <ACTIONITEMS>
          <Item>
            <ACTIONNUMBER>1</ACTIONNUMBER>
            <ACTION>CHANGE ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>AU421115</CHILDCELL>
            <PRODUCTNAME>AU421115</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY>AU</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>small</ENCSIZE>
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
          <Item>
            <ACTIONNUMBER>2</ACTIONNUMBER>
            <ACTION>CHANGE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL></CHILDCELL>
            <PRODUCTNAME>AU421115</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY>AU</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
          <Item>
            <ACTIONNUMBER>3</ACTIONNUMBER>
            <ACTION>UPDATE ENC CELL EDITION UPDATE NUMBER</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>AU421115</CHILDCELL>
            <PRODUCTNAME>AU421115</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY />
            <PROVIDER />
            <ENCSIZE />
            <TITLE />
            <EDITIONNO>19</EDITIONNO>
            <UPDATENO>3</UPDATENO>
            <UNITTYPE />
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY>0FB11A3450</ACTIVEKEY>
            <NEXTKEY>D902ADDB7E</NEXTKEY>
          </Item>
        </ACTIONITEMS>
      </IM_MATINFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>